# StairSetSideLengthsM

## Description
Sets side lengths of stair - not recommended for use as stair might end up with inconsistent and contradictory parameters.

```pascal
FUNCTION StairSetSideLengthsM(
				stair        : HANDLE;
				LengthSide1M : REAL;
				LengthSide2M : REAL;
				LengthSide3M : REAL;
				LengthSide4M : REAL;
				LengthSide5M : REAL): BOOLEAN;
```

```python
def vs.StairSetSideLengthsM(stair, LengthSide1M, LengthSide2M, LengthSide3M, LengthSide4M, LengthSide5M):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE|   |
|LengthSide1M|REAL|   |
|LengthSide2M|REAL|   |
|LengthSide3M|REAL|   |
|LengthSide4M|REAL|   |
|LengthSide5M|REAL|   |

## Version
Availability: from Vectorworks 2021

## Category
* Objects - Stairs